# 2. Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.

# in
# 54

# out
# [2, 3, 3, 3]

# in
# 9990

# out
# [2, 3, 3, 3, 5, 37]

# in
# 650

# out
# [2, 5, 5, 13]


n = int(input("Введите число N: "))
di = 2 
while n > 1:
    if n % di == 0:
        print(di, end=' ')
        n //= di
    else:
        di +=1     